02. New data and CSVs/RH130/211/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 100;

boundaryField
{
    bypassInlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.028;
        k               k;
        value           uniform 1368;
    }
    engine
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        value           uniform 100;
    }
    farfield
    {
        type            inletOutlet;
        inletValue      uniform 100;
        value           uniform 100;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 100;
        value           uniform 100;
    }
    nozzle
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        value           uniform 100;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 100;
        value           uniform 100;
    }
    turbine
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.014;
        k               k;
        value           uniform 4387;
    }
    wedgeL
    {
        type            wedge;
    }
    wedgeR
    {
        type            wedge;
    }
}


// ************************************************************************* //
